import numpy as np
a = np.array([[1, 2, 3, 4, 5]])
b = np.array([[1/2, 1, 2, 3, 4]])
print(a, b)

print("------------")

res = a+b
print(res)

print("------------")

res = a-b
print(res)

print("------------")

#Пояснення: в данному розвязазнні викориcтано метод transpose() бібліотеки numpy для транспонування матриці b з рядка в стовпчик.
#Після чого було виконано додавання матриці а і b. В результатів чого вийшла матриця розміром 5х5.
a = np.array([[1, 2, 3, 4, 5]])
b = np.transpose([[1/2, 1, 2, 3, 4]])
res = a+b
print(res)

print("------------")

a = np.array([[1, 2, 3, 4, 5]])
b = np.transpose([[1/2, 1, 2, 3, 4]])
c = a.dot(b)
print(c)

print("------------")

#Пояснення: Дві матриці можна перемножити між собою тільки тоді, коли кількість стовпців першої матриці дорівнює кількості рядків другої матриці.
res = "Velue Error"
print(res)

print("------------")

# Пояснення: в данному розвязані було використано метод multiply() бібліотеки numpy для отримання добутку Адамара.
a = np.array([[1, 2, 3, 4, 5]])
b = np.array([[1/2, 1, 2, 3, 4]])
c = np.multiply(a,b)
print (c)

print("------------")

# Пояснення: в данному розвязанні матриці діляться поелементно через "/" або divide
a = np.array([[1, 2, 3, 4, 5]])
b = np.array([[1/2, 1, 2, 3, 4]])
res = a/b
print(res)

print("------------")

# Пояснення:в данному розвязазнні викориcтано метод transpose() бібліотеки numpy для транспонування матриці b з рядка в стовпчик.
#Після чого було виконано ділення матриці а і b. В результатів чого вийшла матриця розміром 5х5.
a = np.array([[1, 2, 3, 4, 5]])
b = np.transpose([[1/2, 1, 2, 3, 4]])
c = (a/b)
print(c)

print("------------")